richard-johnson-m/IONIC_Projects-Richard/STM32_Cube_IDE/Reginix_LBC/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SLIDER_HOME_Pin GPIO_PIN_0
#define SLIDER_HOME_GPIO_Port GPIOC
#define SLIDER_HOME_EXTI_IRQn EXTI0_IRQn
#define SLIDER_END_Pin GPIO_PIN_1
#define SLIDER_END_GPIO_Port GPIOC
#define SLIDER_END_EXTI_IRQn EXTI1_IRQn
#define LINEAR_HOME_Pin GPIO_PIN_2
#define LINEAR_HOME_GPIO_Port GPIOC
#define LINEAR_HOME_EXTI_IRQn EXTI2_IRQn
#define LINEAR_END_Pin GPIO_PIN_3
#define LINEAR_END_GPIO_Port GPIOC
#define LINEAR_END_EXTI_IRQn EXTI3_IRQn
#define POWER_ON_Pin GPIO_PIN_4
#define POWER_ON_GPIO_Port GPIOC
#define POWER_ON_OFF_Pin GPIO_PIN_5
#define POWER_ON_OFF_GPIO_Port GPIOC
#define Buzzer_Pin GPIO_PIN_14
#define Buzzer_GPIO_Port GPIOB
#define Linear_DIR_Pin GPIO_PIN_6
#define Linear_DIR_GPIO_Port GPIOC
#define Linear_EN_Pin GPIO_PIN_7
#define Linear_EN_GPIO_Port GPIOC
#define Slider_DIR_Pin GPIO_PIN_8
#define Slider_DIR_GPIO_Port GPIOC
#define Slider_EN_Pin GPIO_PIN_9
#define Slider_EN_GPIO_Port GPIOC
#define WATER_OUT_Pin GPIO_PIN_10
#define WATER_OUT_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
